export const rawItems = [
  [
    {
      title: 'как вывести в браузере "Привет мир!"?',
      answer: ['alert()', 'map()', 'if()', 'for()'],
      correct: 0,
    },
    {
      title:
        'Какой из следующих вариантов является правильным способом объявления переменной в JavaScript?',
      answer: [
        'declare myVariable;',
        'let myVariable =;',
        'var myVariable;',
        'const myVariable: 5;',
      ],
      correct: 2,
    },
    {
      title:
        'Какой из следующих вариантов является правильным способом разделения инструкций в JavaScript?',
      answer: [
        'alert("Привет") alert("Мир")',
        'alert("Привет"); alert("Мир");',
        'alert("Привет") alert("Мир");',
        'alert("Привет"): alert("Мир");',
      ],
      correct: 1,
    },
    {
      title:
        'Какой из следующих вариантов является правильным способом разделения инструкций в JavaScript?',
      answer: [
        'alert("Привет") alert("Мир")',
        'alert("Привет"); alert("Мир");',
        'alert("Привет") alert("Мир");',
        'alert("Привет"): alert("Мир");',
      ],
      correct: 1,
    },
    // Use strict
    {
      title: 'Что делает директива "use strict"?',
      answer: [
        'Включает строгий режим, который помогает избегать ошибок в коде.',
        'Запускает код в режиме отладки.',
        'Отключает все ошибки в коде.',
        'Увеличивает производительность скрипта.',
      ],
      correct: 0,
    },
    {
      title: 'Где должна находиться директива "use strict"?',
      answer: [
        'В конце файла.',
        'В начале файла или функции.',
        'В любом месте кода.',
        'Внутри комментариев.',
      ],
      correct: 1,
    },
    {
      title: 'Можно ли отменить строгий режим после его включения?',
      answer: [
        'Да, с помощью директивы "no use strict".',
        'Нет, строгий режим невозможно отменить.',
        'Да, если код помещён в другую функцию.',
        'Да, если использовать старую версию JavaScript.',
      ],
      correct: 1,
    },
  ],
  [
    {
      title:
        'Какой из следующих вариантов является правильным способом включения строгого режима в функции?',
      answer: [
        'function myFunction() { "use strict"; ... }',
        'function myFunction() { ... "use strict"; }',
        'function myFunction() { use strict; ... }',
        'function myFunction() { strict mode; ... }',
      ],
      correct: 0,
    },
    {
      title: 'Что произойдет, если "use strict" не находится в первой строке скрипта?',
      answer: [
        'Строгий режим все равно будет активирован.',
        'Строгий режим не будет активирован.',
        'Код будет выполнен с ошибками.',
        'Код будет выполнен быстрее.',
      ],
      correct: 1,
    },
    {
      title: 'Какое из следующих утверждений верно для строгого режима?',
      answer: [
        'Он позволяет использовать не объявленные переменные.',
        'Он запрещает использование неявного преобразования типов.',
        'Он делает код менее безопасным.',
        'Он позволяет переопределять встроенные функции.',
      ],
      correct: 1,
    },
  ],

  [
    {
      title: 'Что такое?',
      answer: ['Язык программирования', 'Язык марсиан', 'Язык монголов', 'Язык Гатса'],
      correct: 1,
    },
    {
      title: 'Что такое for?',
      answer: ['Язык программирования', 'Язык путуха', 'Язык монголов', 'Язык Гатса'],
      correct: 2,
    },
  ],
  [
    {
      title: 'Что такое ищт?',
      answer: ['Язык программирования', 'Язык марсиан', 'Язык монголов', 'Язык Гатса'],
      correct: 1,
    },
    {
      title: 'Что такое for?',
      answer: ['Язык программирования', 'Язык путуха', 'Язык монголов', 'Язык Гатса'],
      correct: 2,
    },
  ],
  [
    {
      title: 'Что такое ищт?',
      answer: ['Язык программирования', 'Язык марсиан', 'Язык монголов', 'Язык Гатса'],
      correct: 1,
    },
    {
      title: 'Что такое for?',
      answer: ['Язык программирования', 'Язык путуха', 'Язык монголов', 'Язык Гатса'],
      correct: 2,
    },
  ],
  [
    {
      title: 'Что такое ищт?',
      answer: ['Язык программирования', 'Язык марсиан', 'Язык монголов', 'Язык Гатса'],
      correct: 1,
    },
    {
      title: 'Что такое for?',
      answer: ['Язык программирования', 'Язык путуха', 'Язык монголов', 'Язык Гатса'],
      correct: 2,
    },
  ],
  [
    {
      title: 'Что такое ищт?',
      answer: ['Язык программирования', 'Язык марсиан', 'Язык монголов', 'Язык Гатса'],
      correct: 1,
    },
    {
      title: 'Что такое for?',
      answer: ['Язык программирования', 'Язык путуха', 'Язык монголов', 'Язык Гатса'],
      correct: 2,
    },
  ],
]
